in-tension/ArduinoCore-ETAGRFID/boards.txt
#ETAG RFID (WITH) BOOTLOADER
etagrfid.name=ETAG RFID
etagrfid.vid.0=0x2a03
etagrfid.pid.0=0x004d
etagrfid.vid.1=0x2a03
etagrfid.pid.1=0x804d
etagrfid.vid.2=0x2a03
etagrfid.pid.2=0x004e
etagrfid.vid.3=0x2a03
etagrfid.pid.3=0x804e
etagrfid.upload.tool=avrdude
etagrfid.upload.protocol=stk500v2
etagrfid.upload.maximum_size=262144
etagrfid.upload.use_1200bps_touch=true
etagrfid.upload.wait_for_upload_port=true
etagrfid.upload.native_usb=true
etagrfid.upload.speed=57600
etagrfid.build.mcu=cortex-m0plus
etagrfid.build.f_cpu=48000000L
etagrfid.build.usb_product="Arduino M0"
etagrfid.build.board=SAM_ZERO
etagrfid.build.core=arduino
etagrfid.build.extra_flags=-D__SAMD21G18A__ -mthumb {build.usb_flags}
etagrfid.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
etagrfid.build.variant=etagrfid
etagrfid.build.variant_system_lib=
etagrfid.build.vid=0x2a03
etagrfid.build.pid=0x804e
etagrfid.build.preferred_out_format=hex
etagrfid.bootloader.size=0x4000
etagrfid.build.emu.mcu=atmega2560
etagrfid.bootloader.tool=avrdude
etagrfid.bootloader.low_fuses=0xff